TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
// include/ui/ui_manager.h — top-level LVGL orchestration: display/touch
// init, owns one instance of each of the 5 screen classes, wires their
// shared header/footer taps (logo -> home, date -> calendar, QR -> config),
// and handles horizontal swipe navigation between them.
//
// Each screen's own visual structure lives in its dedicated header
// (screen_turbo.h, screen_debt.h, screen_game.h, screen_node.h) plus the
// Clock screen built inline below (kept as the original reference pattern).
//
// HARDWARE BRING-UP (initDisplayAndTouch):
//   Fully implemented based on Seeed's reference firmware:
//     github.com/Seeed-Solution/SenseCAP_Indicator_ESP32
//   The sequence is:
//     1. I2C bus init (SDA=39, SCL=40, shared by TCA9535 + FT6336U)
//     2. TCA9535 IO expander config (LCD_CS, LCD_RST, TP_RST as outputs)
//     3. ST7701S panel reset + 9-bit SPI init sequence (GPIO 41/48 bit-bang)
//     4. FT6336U touch reset (via expander) + LVGL input driver registration
//     5. RGB panel creation via esp_lcd_new_rgb_panel() (requires IDF 5.x /
//        Arduino-ESP32 3.x -- see platformio.ini's espressif32@^6.0.0)
//     6. Backlight enable (GPIO 45, active HIGH)

#pragma once
#include <Wire.h>
#include <lvgl.h>
#include "esp_lcd_panel_rgb.h"
#include "esp_lcd_panel_ops.h"
#include "driver/gpio.h"
#include "esp_sleep.h"          // light sleep for the user-button "power off"
#include "board_pins.h"
#include "api_client.h"
#include "rp2040_link.h"   // confirmation chime on alarm save (link self-test)
#include "storage.h"

// Large clock font (Montserrat 72px, digits + ":" + AM/PM) — assets/montserrat_clock.c
LV_FONT_DECLARE(montserrat_clock);
#include "ui/shared_components.h"
#include "ui/modal.h"
#include "ui/screen_turbo.h"
#include "ui/screen_debt.h"
#include "ui/screen_game.h"
#include "ui/screen_node.h"
#include "ui/screen_tickers.h"
#include "ui/screen_nft.h"

enum class ScreenId : uint8_t {
    CLOCK = 0,
    TURBO_STATS = 1,
    DEBT = 2,
    INFLATION_GAME = 3,
    NODE_NETWORK = 4,
    NFT = 5,      // penultimate — full-screen gallery
    TICKERS = 6,  // last — settings-like screener
    COUNT = 7
};

class UiManager {
public:
    void begin() {
        // lv_init() must come before initDisplayAndTouch() so the display
        // and input drivers can be registered inside that function.
        lv_init();
        initDisplayAndTouch();
        buildAllScreens();
        _loadScreenOrder();
        showScreen(ScreenId::CLOCK, false);  // instant first load — no animation
    }

    void loop() {
        lv_timer_handler();
        updateClockIfNeeded();
        _checkScreenTimeout();
    }

    // Set backlight brightness level 1–5 immediately via LEDC PWM.
    void setScreenBrightness(uint8_t level) {
        static const uint8_t DUTY[5] = { 25, 70, 130, 185, 255 };
        level = constrain(level, 1, 5);
        ledcWrite(0, DUTY[level - 1]);  // channel 0 = backlight (see ledcSetup in initDisplayAndTouch)
    }

    // Read brightness from NVS and apply it immediately.
    void applyStoredBrightness() {
        setScreenBrightness(storage.getScreenBrightness());
    }

    // ── User button actions (top button, GPIO 38) ──────────────────────────
    // Short press: toggle the screen (backlight off/on) while the node keeps
    // running and mining in the background.
    void toggleScreen() {
        _screenOn = !_screenOn;
        if (_screenOn) applyStoredBrightness();
        else           ledcWrite(0, 0);   // backlight off (channel 0)
    }

    // Long press (3 s): "power off" — backlight off and enter light sleep. RAM
    // and the LVGL framebuffer are retained, so a press resumes instantly where
    // it left off. We deliberately do NOT wire a factory-reset action to the
    // button, so the firmware can't be wiped by accident. GPIO 38 isn't an RTC
    // pin, so this uses light sleep (any-GPIO wake), not deep sleep.
    void enterSleep() {
        ledcWrite(0, 0);                         // backlight off
        gpio_wakeup_enable((gpio_num_t)BTN_USER_GPIO, GPIO_INTR_LOW_LEVEL);
        esp_sleep_enable_gpio_wakeup();
        esp_light_sleep_start();                 // blocks until the button is pressed
        // Woken up: restore the screen.
        _screenOn = true;
        applyStoredBrightness();
    }

    void showProvisioningScreen() {
        static bool shown = false;
        if (shown) return;
        shown = true;
        // Build a dedicated screen and load it instantly. We do NOT clean the
        // currently-active screen (cleaning a screen that may still be mid-load
        // animation corrupts LVGL and crashes → reset loop).
        lv_obj_t* scr = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(scr, lv_color_black(), 0);
        lv_obj_t* label = lv_label_create(scr);
        lv_label_set_text(label, "Connect your phone to:\nTurboUSD-Setup-XXXX\nthen open the page that appears.");
        lv_obj_set_style_text_color(label, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
        lv_obj_center(label);
        lv_scr_load(scr);
    }

    bool isOnNodeScreen() { return currentScreen == ScreenId::NODE_NETWORK; }

    // Called by main.cpp when the nightly OTA check finds a newer version.
    // Creates a small persistent badge at the bottom of the screen. Tapping
    // it opens a confirm dialog; on confirm, onOtaInstallConfirmed is called.
    void showOtaBadge(const char* version) {
        clearOtaBadge(); // remove any existing one first

        _otaBadge = lv_obj_create(lv_layer_top()); // layer_top() floats over all screens
        lv_obj_set_size(_otaBadge, LV_PCT(100), 42);
        lv_obj_align(_otaBadge, LV_ALIGN_BOTTOM_MID, 0, 0);
        lv_obj_set_style_bg_color(_otaBadge, lv_color_hex(0x1c2c1c), 0);
        lv_obj_set_style_border_color(_otaBadge, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_border_width(_otaBadge, 1, 0);
        lv_obj_set_style_border_side(_otaBadge, LV_BORDER_SIDE_TOP, 0);
        lv_obj_set_style_pad_all(_otaBadge, 0, 0);
        lv_obj_add_flag(_otaBadge, LV_OBJ_FLAG_CLICKABLE);

        lv_obj_t* label = lv_label_create(_otaBadge);
        char text[48];
        snprintf(text, sizeof(text), "\xEF\x81\xB7 Firmware %s available — tap to install", version);
        lv_label_set_text(label, text);
        lv_obj_set_style_text_color(label, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(label, &lv_font_montserrat_12, 0);
        lv_obj_center(label);

