TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // Store version string in badge's user_data so the callback can show it
        static char versionBuf[24];
        strncpy(versionBuf, version, sizeof(versionBuf) - 1);
        lv_obj_set_user_data(_otaBadge, versionBuf);
        lv_obj_add_event_cb(_otaBadge, onOtaBadgeTapped, LV_EVENT_CLICKED, this);
    }

    void clearOtaBadge() {
        if (_otaBadge) { lv_obj_del(_otaBadge); _otaBadge = nullptr; }
    }

    // Set this before begin(). Called when user confirms "Install".
    std::function<void()> onOtaInstallConfirmed;

    bool miningFeedNeedsRefresh() {
        uint32_t now = millis();
        if (now - lastMiningFeedFetch < MINING_FEED_REFRESH_MS) return false;
        lastMiningFeedFetch = now;
        return true;
    }

    void updateTreasuryData(const TreasuryData& data) {
        latestTreasury = data;
        turboScreen.updateData(data);
    }

    void loadOhlcvChart(OhlcvCandle* candles, int count) {
        turboScreen.loadRealCandles(candles, count);
    }

    // Live TUSD price from DexScreener/GeckoTerminal (independent of the
    // treasury service, which may be down / not deployed).
    void updateTusdPrice(double priceUsd) {
        turboScreen.updatePrice(priceUsd);
    }

    void updateDebtData(const DebtData& data) {
        latestDebt = data;
        debtScreen.updateLiveTotal(data.totalDebtUsd);
        // Load the historical chart + SINCE/RATE once, on the first live total.
        if (!_debtHistLoaded) {
            static const int yearValues[] = {5, 10, 20, 30, 50, 75};
            reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
        }
    }

    void updateMiningFeed(MiningFeedEntry* entries, int count) {
        nodeScreen.updateMiningFeed(entries, count);
        // Remember when the countdown started, for the per-second ring/strip:
        // preferred = the pending block's created_at; fallback (same rule the
        // web uses, and what keeps this working if the DB view lacks
        // created_at) = the newest mined block's mined_at.
        time_t newestMined = 0;
        for (int i = 0; i < count; i++) {
            if (entries[i].mined && entries[i].minedAtUtc > newestMined)
                newestMined = entries[i].minedAtUtc;
            if (!entries[i].mined) {
                if (entries[i].createdAtUtc > 0) _pendingBlockCreatedAt = entries[i].createdAtUtc;
                _pendingBlockReward = entries[i].rewardTusd > 0 ? entries[i].rewardTusd : 100.0;
            }
        }
        if (_pendingBlockCreatedAt == 0 && newestMined > 0)
            _pendingBlockCreatedAt = newestMined;
    }

    // Called from the main loop after a successful RP2040 sensor poll. The new
    // values appear on the next per-second header/Home refresh, so there's no
    // need to redraw here.
    void updateAmbient(float tempC, int humidityPct) {
        _tempC = tempC;
        _humidityPct = humidityPct;
        _sensorValid = true;
    }

    // Called when a sensor poll fails (link down, or no AHT20 plugged in).
    // Drops back to showing "--" rather than a stale reading.
    void markAmbientUnavailable() {
        _sensorValid = false;
    }

    void showAlarmFiringOverlay() {
        lv_obj_t* overlay = lv_obj_create(lv_scr_act());
        lv_obj_set_size(overlay, LV_PCT(100), LV_PCT(100));
        lv_obj_set_style_bg_color(overlay, lv_color_hex(0xe8b339), 0);
        lv_obj_center(overlay);

        lv_obj_t* stopBtn = lv_btn_create(overlay);
        lv_obj_set_size(stopBtn, 160, 60);
        lv_obj_center(stopBtn);
        lv_obj_add_event_cb(stopBtn, [](lv_event_t* e) {
            UiManager* self = (UiManager*)lv_event_get_user_data(e);
            self->dismissAlarmOverlay();
        }, LV_EVENT_CLICKED, this);
        lv_obj_t* stopLabel = lv_label_create(stopBtn);
        lv_label_set_text(stopLabel, "STOP");
        lv_obj_center(stopLabel);

        alarmOverlay = overlay;
    }

    std::function<void()> onAlarmDismissed;

    // True while the yellow "alarm firing" overlay is up (i.e. the user hasn't
    // tapped STOP yet). main.cpp uses this to periodically re-send PLAY_ALARM
    // to the RP2040, so one lost UART frame can't result in a silent alarm.
    bool isAlarmOverlayActive() const { return alarmOverlay != nullptr; }

    // Public entry point for the physical top button: stop the ringing alarm
    // exactly like tapping the on-screen STOP.
    void stopRingingAlarm() { dismissAlarmOverlay(); }

    // Called from the touch input driver whenever the screen is physically touched.
    // Resets the inactivity timer and wakes the backlight if it was off.
    void _onTouchActivity() {
        _lastTouchMs  = millis();
        if (!_screenIsOn) {
            _screenIsOn = true;
            applyStoredBrightness();
        }
    }

    // Checked every loop() tick. Turns off the backlight after the configured
    // idle period when always-on mode is disabled.
    void _checkScreenTimeout() {
        if (storage.getScreenAlwaysOn()) return;
        uint32_t timeoutMs = (uint32_t)storage.getScreenTimeoutMins() * 60UL * 1000UL;
        if (_screenIsOn && (millis() - _lastTouchMs > timeoutMs)) {
            _screenIsOn = false;
            ledcWrite(0, 0);  // channel 0 = backlight
        }
    }

private:
    ScreenId currentScreen = ScreenId::CLOCK;
    lv_obj_t* screens[(int)ScreenId::COUNT] = { nullptr };
    lv_obj_t* alarmOverlay = nullptr;

    // Screen timeout state
    uint32_t _lastTouchMs = 0;     // millis() of the last touch event
    bool     _screenIsOn  = true;  // false while backlight is off due to timeout

    // Swipe order: _swipeOrder[swipe_pos] = ScreenId value.
    // Default (matches the intended UX order):
    //   pos 0 → CLOCK(0)        Home
    //   pos 1 → TURBO_STATS(1)  Price/chart
    //   pos 2 → TICKERS(6)      Token screener  ← screen 3 (user-facing)
    //   pos 3 → DEBT(2)         US debt
    //   pos 4 → INFLATION_GAME(3) Inflation calculator
    //   pos 5 → NFT(5)          NFT gallery     ← penultimate
    //   pos 6 → NODE_NETWORK(4) Node status     ← last
    // Can be overridden per-device from NVS (set via web setup page). Position 0 is always CLOCK.
    uint8_t _swipeOrder[(int)ScreenId::COUNT] = { 0, 1, 6, 2, 3, 5, 4 };
    int     _currentSwipePos = 0;

