TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        LV_IMG_DECLARE(turbousd_logo);
        lv_obj_t* logo = lv_img_create(scr);
        lv_img_set_src(logo, &turbousd_logo);
        lv_img_set_zoom(logo, 170);   // ~32px
        lv_obj_align(logo, LV_ALIGN_TOP_MID, 0, 10);

        // Date — larger, letter-spaced; tap opens the calendar.
        clockDateLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockDateLabel, lv_color_hex(0xcfcfd4), 0);
        lv_obj_set_style_text_font(clockDateLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_letter_space(clockDateLabel, 3, 0);
        lv_obj_align(clockDateLabel, LV_ALIGN_CENTER, 0, -84);
        lv_obj_add_flag(clockDateLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockDateLabel, 12);
        lv_obj_add_event_cb(clockDateLabel, onDateTapped, LV_EVENT_CLICKED, this);

        // Time — big custom Montserrat font.
        clockTimeLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockTimeLabel, lv_color_hex(0x3aff7a), 0);
        lv_obj_set_style_text_font(clockTimeLabel, &montserrat_clock, 0);
        lv_obj_align(clockTimeLabel, LV_ALIGN_CENTER, 0, -6);

        // Alarm — rounded pill; colour (border + text) follows the alarm state,
        // set each second in updateClockIfNeeded (yellow = on, grey = off).
        clockAlarmLabel = lv_label_create(scr);
        lv_obj_set_style_text_font(clockAlarmLabel, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_radius(clockAlarmLabel, 16, 0);
        lv_obj_set_style_border_width(clockAlarmLabel, 2, 0);
        lv_obj_set_style_border_color(clockAlarmLabel, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_pad_hor(clockAlarmLabel, 16, 0);
        lv_obj_set_style_pad_ver(clockAlarmLabel, 7, 0);
        lv_obj_align(clockAlarmLabel, LV_ALIGN_CENTER, 0, 78);
        lv_obj_add_flag(clockAlarmLabel, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(clockAlarmLabel, 10);
        lv_obj_add_event_cb(clockAlarmLabel, onAlarmLabelTapped, LV_EVENT_CLICKED, this);

        // Ambient temp/humidity line, e.g. "23° · 48%" (from the RP2040 AHT20).
        clockWeatherLabel = lv_label_create(scr);
        lv_obj_set_style_text_color(clockWeatherLabel, lv_color_hex(0x9a9a9e), 0);
        lv_obj_set_style_text_font(clockWeatherLabel, &lv_font_montserrat_16, 0);
        lv_obj_align(clockWeatherLabel, LV_ALIGN_CENTER, 0, 64);
        lv_label_set_text(clockWeatherLabel, "--\xC2\xB0 \xE2\x80\xA2 --%");
        lv_obj_add_flag(clockWeatherLabel, LV_OBJ_FLAG_HIDDEN);  // hidden per design; code kept

        clockFooterRefs = buildSharedFooter(scr, onQrTapped, this);

        return scr;
    }

    void updateClockIfNeeded() {
        time_t now = time(nullptr);
        struct tm t;
        localtime_r(&now, &t);  // local wall-clock (tz offset set via configTime/geo)
        if ((uint32_t)t.tm_sec == lastClockRedrawSecond) return;
        lastClockRedrawSecond = t.tm_sec;

        // Refresh alarm-bell icons on every non-clock header once per second.
        bool alarmOn    = storage.getAlarmEnabled();
        bool todayOn    = storage.isAlarmActiveToday(t.tm_wday);
        refreshSharedAlarmIcon(turboScreen.header,  alarmOn, todayOn);
        refreshSharedAlarmIcon(debtScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(gameScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(nodeScreen.header,   alarmOn, todayOn);
        refreshSharedAlarmIcon(tickerScreen.header, alarmOn, todayOn);
        refreshSharedAlarmIcon(nftScreen.header,    alarmOn, todayOn);

        // Refresh the date/time/temp/humidity text in every non-clock header.
        // (Previously nothing called this, so those headers showed no clock and
        // the temp/humidity labels stayed blank.) Temp/humidity come from the
        // RP2040 AHT20 poll; when there's no valid reading they render as "--".
        bool is24h      = storage.getTimeFormat() == "24H";
        char tempUnit   = storage.getTempUnit();
        refreshSharedHeader(turboScreen.header,  t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(debtScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(gameScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(nodeScreen.header,   t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(tickerScreen.header, t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);
        refreshSharedHeader(nftScreen.header,    t, _tempC, _humidityPct, is24h, tempUnit, _sensorValid);

        // Refresh every footer (node name/code + "| N NODES"). Nothing was
        // calling this, so all footers showed LVGL's default "Text". Until the
        // device has a display name, show its node code; before it's even
        // registered, show a short placeholder.
        String footerName = storage.getNodeCode();
        if (footerName.length() == 0) footerName = "NEW NODE";
        refreshSharedFooter(clockFooterRefs,     footerName, _onlineNodeCount);
        refreshSharedFooter(turboScreen.footer,  footerName, _onlineNodeCount);
        refreshSharedFooter(debtScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(gameScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(nodeScreen.footer,   footerName, _onlineNodeCount);
        refreshSharedFooter(tickerScreen.footer, footerName, _onlineNodeCount);
        refreshSharedFooter(nftScreen.footer,    footerName, _onlineNodeCount);

        // Debounced debt-range refetch (set by the range picker's live-apply).
        if (_debtRangeDirty) {
            _debtRangeDirty = false;
            static const int yearValues[] = {5, 10, 20, 30, 50, 75};
            reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
        }

        // Real mining countdown (pending block opened_at + 1 h), once per tick.
        if (_pendingBlockCreatedAt > 0) {
            time_t nowUtc = time(nullptr);
            if (nowUtc > 1600000000) {   // only once NTP has synced
                long secsLeft = (long)(_pendingBlockCreatedAt + 3600 - nowUtc);
                nodeScreen.updateCountdown(secsLeft, _pendingBlockReward);
            }
        }

        // Node & Network headline (name, badge, rewards hint, uptime) — the
        // identity fields sync down from the backend on each heartbeat (see
        // applyServerConfig); uptime counts from boot. Refresh every 30 s.
        static uint32_t lastNodeStatusAt = 0;
        if (lastNodeStatusAt == 0 || millis() - lastNodeStatusAt > 30000) {
            lastNodeStatusAt = millis();
            String nm = storage.getDisplayName();
            if (nm.length() == 0) nm = "NODE " + storage.getNodeCode();
            nodeScreen.setNodeName(nm);
            bool ver = storage.getIsVerified();
            nodeScreen.setVerified(ver);
            nodeScreen.setRewards(ver, storage.getTotalEarned());
            uint32_t secs = millis() / 1000;
            char ub[20];
            if      (secs < 3600)  snprintf(ub, sizeof(ub), "%lum", (unsigned long)(secs / 60));
            else if (secs < 86400) snprintf(ub, sizeof(ub), "%luh %lum",
                                            (unsigned long)(secs / 3600), (unsigned long)((secs % 3600) / 60));
            else                   snprintf(ub, sizeof(ub), "%lud %luh",
                                            (unsigned long)(secs / 86400), (unsigned long)((secs % 86400) / 3600));
            nodeScreen.setUptime(ub);
        }

        // Clock/Home screen text only below
        if (currentScreen != ScreenId::CLOCK) return;

        // Home ambient line, e.g. "23° · 48%" (or "--° · --%" with no sensor).
        if (clockWeatherLabel) {
            char wBuf[24];
            if (_sensorValid) {
                float dT = (tempUnit == 'F') ? (_tempC * 9.0f / 5.0f + 32.0f) : _tempC;
                snprintf(wBuf, sizeof(wBuf), "%d\xC2\xB0 \xE2\x80\xA2 %d%%", (int)roundf(dT), _humidityPct);
            } else {
                snprintf(wBuf, sizeof(wBuf), "--\xC2\xB0 \xE2\x80\xA2 --%%");
            }
            lv_label_set_text(clockWeatherLabel, wBuf);
        }

        char timeBuf[12];
        if (is24h) snprintf(timeBuf, sizeof(timeBuf), "%02d:%02d", t.tm_hour, t.tm_min);
        else {
            int hour12 = t.tm_hour % 12; if (hour12 == 0) hour12 = 12;
            snprintf(timeBuf, sizeof(timeBuf), "%d:%02d %s", hour12, t.tm_min, t.tm_hour < 12 ? "AM" : "PM");
        }
        lv_label_set_text(clockTimeLabel, timeBuf);

        char dateBuf[24];
        const char* days[] = {"SUN","MON","TUE","WED","THU","FRI","SAT"};
        if (storage.getDateFormat() == "DD/MM")
            snprintf(dateBuf, sizeof(dateBuf), "%s %02d.%02d.%04d", days[t.tm_wday], t.tm_mday, t.tm_mon+1, t.tm_year+1900);
        else
            snprintf(dateBuf, sizeof(dateBuf), "%s %02d.%02d.%04d", days[t.tm_wday], t.tm_mon+1, t.tm_mday, t.tm_year+1900);
        lv_label_set_text(clockDateLabel, dateBuf);

        // Alarm pill: ALWAYS show the configured (or default) alarm time so the
        // user can see it at a glance. Yellow (border + icon + text) when the
        // alarm is enabled, grey when it's off — the time stays visible either way.
        char alarmBuf[28];
        lv_color_t alarmCol = alarmOn ? lv_color_hex(0xe8b339)   // yellow = on
                                      : lv_color_hex(0x6e7280);  // grey   = off
        snprintf(alarmBuf, sizeof(alarmBuf), "\xEF\x83\xB3 %02d:%02d",
                 storage.getAlarmHour(), storage.getAlarmMinute());
        lv_label_set_text(clockAlarmLabel, alarmBuf);
        lv_obj_set_style_text_color(clockAlarmLabel, alarmCol, 0);
        lv_obj_set_style_border_color(clockAlarmLabel, alarmCol, 0);
    }

    static void onOtaBadgeTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        const char* version = (const char*)lv_obj_get_user_data(lv_event_get_current_target(e));

        lv_obj_t* card = openModal(lv_layer_top());
        lv_obj_t* title = lv_label_create(card);
        char titleText[32]; snprintf(titleText, sizeof(titleText), "UPDATE TO %s", version ? version : "NEW VERSION");
        lv_label_set_text(title, titleText);
        lv_obj_set_style_text_color(title, lv_color_hex(0x3aff7a), 0);

        lv_obj_t* body = lv_label_create(card);
        lv_label_set_long_mode(body, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(body, 280);
        lv_label_set_text(body,
            "The new firmware will download and install automatically. "
            "Your device will restart once — takes about 30 seconds total. "
            "All your settings are preserved.");
        lv_obj_set_style_text_color(body, lv_color_hex(0x9a9a9e), 0);

        lv_obj_t* row = lv_obj_create(card);
        lv_obj_set_size(row, LV_PCT(100), LV_SIZE_CONTENT);
        lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
        lv_obj_set_style_pad_column(row, 8, 0);
        lv_obj_set_style_bg_opa(row, LV_OPA_0, 0);
        lv_obj_set_style_border_width(row, 0, 0);

        lv_obj_t* cancelBtn = addModalButton(row, "LATER", false);
        lv_obj_t* installBtn = addModalButton(row, "INSTALL NOW", true);

