TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        static lv_obj_t* sCard; sCard = card;
        static UiManager* sSelf; sSelf = self;

        lv_obj_add_event_cb(cancelBtn, [](lv_event_t*) {
            closeModal(sCard);
        }, LV_EVENT_CLICKED, nullptr);

        lv_obj_add_event_cb(installBtn, [](lv_event_t*) {
            closeModal(sCard);
            // Show a "Downloading..." label before handing off to main.cpp
            lv_obj_t* splash = lv_obj_create(lv_layer_top());
            lv_obj_set_size(splash, LV_PCT(100), LV_PCT(100));
            lv_obj_set_style_bg_color(splash, lv_color_hex(0x000000), 0);
            lv_obj_center(splash);
            lv_obj_t* dlLabel = lv_label_create(splash);
            lv_label_set_text(dlLabel, "Downloading update...\nDo not turn off.");
            lv_obj_set_style_text_color(dlLabel, lv_color_hex(0x3aff7a), 0);
            lv_obj_center(dlLabel);
            lv_timer_handler(); // force a redraw so the splash is visible
            if (sSelf->onOtaInstallConfirmed) sSelf->onOtaInstallConfirmed();
        }, LV_EVENT_CLICKED, nullptr);
    }

    static void onAlarmLabelTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onAlarmIconTapped(lv_event_t* e)  { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onLogoTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->showScreen(ScreenId::CLOCK); }
    static void onDateTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openCalendarPopup(); }
    static void onQrTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openConfigPopup(); }
    static void onDebtRangeTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openDebtRangePicker(); }
    static void onSinceBtnTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openSincePeriodPicker(); }
    static void onRateBtnTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openRateUnitPicker(); }
    static void onGameYearsTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openGameYearsPicker(); }
    static void onVerifyBadgeTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openVerifyTooltip(); }

    void openAlarmPicker() {
        lv_obj_t* card = openModal(lv_scr_act());

        lv_obj_t* title = lv_label_create(card);
        lv_label_set_text(title, "SET ALARM");
        lv_obj_set_style_text_color(title, lv_color_hex(0x9a9a9e), 0);

        // ── Day-of-week selector strip ────────────────────────────────────────
        // Layout: 7 squares (32×32) with 4px gap, centred.
        // Display order follows the week-start setting (auto-set from geo-IP,
        // user-overridable): 0 = Sunday first, 1 = Monday first.
        // Storage bitmask: bit0=Mon, bit1=Tue, …, bit6=Sun (ISO).
        // dayOrder[display_pos] = bitmask_bit_index
        bool sunFirst = (storage.getWeekStart() == 0);

        // Display order of bitmask-bit indices
        static const uint8_t dayOrderMon[7] = { 0, 1, 2, 3, 4, 5, 6 }; // Mon…Sun
        static const uint8_t dayOrderSun[7] = { 6, 0, 1, 2, 3, 4, 5 }; // Sun Mon…Sat
        const uint8_t* dayOrder = sunFirst ? dayOrderSun : dayOrderMon;

        // Day labels for each display position
        static const char* dayLabelsMon[7] = { "M","T","W","T","F","S","S" };
        static const char* dayLabelsSun[7] = { "S","M","T","W","T","F","S" };
        const char** dayLabels = sunFirst ? dayLabelsSun : dayLabelsMon;

        // Working copy of the day mask — modified as user taps, saved on SAVE
        static uint8_t sDayMask;
        sDayMask = storage.getAlarmDays();

        lv_obj_t* daysRow = lv_obj_create(card);
        lv_obj_set_size(daysRow, LV_PCT(100), 36);
        lv_obj_set_style_bg_opa(daysRow, LV_OPA_0, 0);
        lv_obj_set_style_border_width(daysRow, 0, 0);
        lv_obj_set_style_pad_all(daysRow, 0, 0);
        lv_obj_set_style_pad_column(daysRow, 4, 0);
        lv_obj_set_flex_flow(daysRow, LV_FLEX_FLOW_ROW);
        lv_obj_set_flex_align(daysRow, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

        for (int pos = 0; pos < 7; pos++) {
            uint8_t bitIdx = dayOrder[pos];

            lv_obj_t* tile = lv_btn_create(daysRow);
            lv_obj_set_size(tile, 32, 32);
            lv_obj_set_style_radius(tile, 6, 0);
            lv_obj_set_style_pad_all(tile, 0, 0);

            bool active = (sDayMask >> bitIdx) & 1;
            lv_obj_set_style_bg_color(tile, lv_color_hex(active ? 0xe8b339 : 0x1a1a1a), 0);
            lv_obj_set_style_border_color(tile, lv_color_hex(active ? 0xe8b339 : 0x3a3a3a), 0);
            lv_obj_set_style_border_width(tile, 1, 0);

            lv_obj_t* lbl = lv_label_create(tile);
            lv_label_set_text(lbl, dayLabels[pos]);
            lv_obj_set_style_text_font(lbl, &lv_font_montserrat_12, 0);
            lv_obj_set_style_text_color(lbl, lv_color_hex(active ? 0x000000 : 0x6e7280), 0);
            lv_obj_center(lbl);

            // Store bit index in user data; tile's child label is lbl
            lv_obj_set_user_data(tile, (void*)(intptr_t)bitIdx);
            lv_obj_add_event_cb(tile, [](lv_event_t* ev) {
                lv_obj_t* t = lv_event_get_current_target(ev);
                uint8_t bit = (uint8_t)(intptr_t)lv_obj_get_user_data(t);
                // Toggle bit
                sDayMask ^= (1u << bit);
                bool nowActive = (sDayMask >> bit) & 1;
                lv_obj_set_style_bg_color(t, lv_color_hex(nowActive ? 0xe8b339 : 0x1a1a1a), 0);
                lv_obj_set_style_border_color(t, lv_color_hex(nowActive ? 0xe8b339 : 0x3a3a3a), 0);
                lv_obj_t* childLbl = lv_obj_get_child(t, 0);
                if (childLbl) {
                    lv_obj_set_style_text_color(childLbl,
                        lv_color_hex(nowActive ? 0x000000 : 0x6e7280), 0);
                }
            }, LV_EVENT_CLICKED, nullptr);
        }

        // ── Time picker ───────────────────────────────────────────────────────
        TimePickerRefs refs = addTimePicker(card, storage.getAlarmHour(), storage.getAlarmMinute());

