TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        addPrefToggleRow(card, "WEEK STARTS", "MON", "SUN",
                          storage.getWeekStart() == 1,
                          [](bool leftActive){ storage.setWeekStart(leftActive ? 1 : 0); storage.setLocaleLocked(true); });

        // Button reference (informational) — bottom of the preferences card.
        lv_obj_t* btnInfo = lv_label_create(card);
        lv_label_set_text(btnInfo,
            "Top button: short press = screen on/off,  hold 3s = sleep.");
        lv_obj_set_style_text_color(btnInfo, lv_color_hex(0x6e7280), 0);
        lv_obj_set_style_text_font(btnInfo, &lv_font_montserrat_10, 0);

        lv_obj_t* closeBtn = addModalButton(card, "CLOSE", false);
        static lv_obj_t* sCard; sCard = card;
        lv_obj_add_event_cb(closeBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void openVerifyTooltip() {
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* label = lv_label_create(card);
        lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(label, 280);
        lv_label_set_text(label,
            "Verification pending.\n\n"
            "To get verified:\n"
            "1. Post a video on X tagging @turbousd\n"
            "2. Write your node name on paper, show it matches your screen\n"
            "3. Include the wallet holding your TUSD\n"
            "4. We manually review and whitelist your node");
        lv_obj_set_style_text_color(label, lv_color_hex(0x9a9a9e), 0);
        lv_obj_t* closeBtn = addModalButton(card, "GOT IT", false);
        static lv_obj_t* sCard; sCard = card;
        lv_obj_add_event_cb(closeBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void openDebtRangePicker() {
        static const char* options = "5Y\n10Y\n20Y\n30Y\n50Y\n75Y";
        static const int yearValues[] = {5, 10, 20, 30, 50, 75};
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* roller = addOptionPicker(card, options, debtYearsRangeIndex);
        lv_obj_t* saveBtn = addModalButton(card, "SAVE", true);
        static lv_obj_t* sCard; sCard = card;
        static UiManager* sSelf; sSelf = this;
        // Live-apply: scrolling the roller updates the selection + button label
        // immediately (closing with the X used to silently discard the pick).
        // The actual history refetch is DEFERRED via _debtRangeDirty — it's a
        // 1-2 s HTTPS call, too heavy to run per scroll detent.
        lv_obj_add_event_cb(roller, [](lv_event_t* e) {
            sSelf->debtYearsRangeIndex = lv_roller_get_selected(lv_event_get_target(e));
            int years = yearValues[sSelf->debtYearsRangeIndex % 6];
            char btnLabel[12]; snprintf(btnLabel, sizeof(btnLabel), "LAST %dY \xEF\x81\xB8", years);
            sSelf->debtScreen.setRangeButtonLabel(btnLabel);
            sSelf->_debtRangeDirty = true;   // picked up once a second in updateClockIfNeeded
        }, LV_EVENT_VALUE_CHANGED, nullptr);
        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void reloadDebtHistory(int years) {
        DebtHistoryPoint points[80];
        int count = apiClient.fetchDebtHistory(years, points, 80);
        if (count == 0) {
            Serial.println("reloadDebtHistory: no data returned, leaving chart as-is.");
            return;
        }
        // Find the data's min/max so we can (a) fit the Y axis to it and (b) fill
        // the axis legend.
        double minUsd = points[0].totalDebtUsd, maxUsd = points[0].totalDebtUsd;
        for (int i = 1; i < count; i++) {
            if (points[i].totalDebtUsd < minUsd) minUsd = points[i].totalDebtUsd;
            if (points[i].totalDebtUsd > maxUsd) maxUsd = points[i].totalDebtUsd;
        }

        lv_chart_set_point_count(debtScreen.getChart(), count);
        // Fit the Y axis to the data. lv_chart's DEFAULT range is 0..100, but our
        // scaled values are ~200..365 (tenths of a trillion), so without this the
        // whole series was clipped to a flat line pinned at the top of the chart.
        lv_coord_t loScaled = (lv_coord_t)(minUsd / 1e11);
        lv_coord_t hiScaled = (lv_coord_t)(maxUsd / 1e11);
        if (hiScaled <= loScaled) hiScaled = loScaled + 1;
        lv_coord_t pad = (hiScaled - loScaled) / 12 + 1;   // small headroom so it isn't glued to the edges
        lv_coord_t lo  = loScaled - pad;
        if (lo < 0) lo = 0;   // debt can't be negative — the bottom tick used to read "$-3T"
        lv_chart_set_range(debtScreen.getChart(), LV_CHART_AXIS_PRIMARY_Y, lo, hiScaled + pad);

        for (int i = 0; i < count; i++) {
            // Scale to an integer-friendly range for lv_chart (raw USD values
            // are far too large for lv_coord_t); express in tenths of a
            // trillion so the chart's y-axis still reads meaningfully.
            lv_coord_t scaled = (lv_coord_t)(points[i].totalDebtUsd / 1e11);
            lv_chart_set_next_value(debtScreen.getChart(), debtScreen.getSeries(), scaled);
        }
        debtScreen.updateAxisLegend(points[0].year, points[count - 1].year, minUsd, maxUsd);

        // Derive a real annual $ debasement rate from the debt's growth over the
        // loaded span, for the inflation game. (Compound annual growth rate.)
        if (count >= 2 && points[count - 1].year > points[0].year && points[0].totalDebtUsd > 0) {
            double growth = points[count - 1].totalDebtUsd / points[0].totalDebtUsd;
            int span = points[count - 1].year - points[0].year;
            double r = pow(growth, 1.0 / span) - 1.0;
            if (r > 0.005 && r < 0.6) _annualDebasementRate = r;
        }
        _updateGameProjection();
        // Derive the debt-clock rate ($/sec) from the most recent year-over-year
        // change, then refresh the SINCE / RATE widgets.
        if (count >= 2) {
            double dDebt  = points[count - 1].totalDebtUsd - points[count - 2].totalDebtUsd;
            int    dYears = points[count - 1].year - points[count - 2].year;
            if (dYears < 1) dYears = 1;
            _debtPerSecond = dDebt / (dYears * 365.25 * 86400.0);
            _computeDebtDerived();
        }
        _debtHistLoaded = true;
    }

    // Fill the SINCE / RATE value labels + button labels from the computed rate.
    void _computeDebtDerived() {
        static const long unitSec[]   = {1, 60, 3600, 86400};                 // SEC MIN HOUR DAY
        static const long periodSec[] = {3600, 86400, 604800, 2592000};       // 1H 24H 7D 30D
        debtScreen.updateRateValue(_debtPerSecond * unitSec[rateUnitIndex % 4]);
        long secs = (sincePeriodIndex < 4) ? periodSec[sincePeriodIndex]
                                            : (long)(millis() / 1000);          // "NODE ON" ≈ uptime
        debtScreen.updateSinceValue(_debtPerSecond * secs);

        static const char* sinceOpts[] = {"1H", "24H", "7D", "30D", "NODE ON"};
        static const char* rateOpts[]  = {"SEC", "MIN", "HOUR", "DAY"};
        char buf[16];
        snprintf(buf, sizeof(buf), "%s \xEF\x81\xB8", sinceOpts[sincePeriodIndex % 5]);
        debtScreen.setSinceButtonLabel(buf);
        snprintf(buf, sizeof(buf), "%s \xEF\x81\xB8", rateOpts[rateUnitIndex % 4]);
        debtScreen.setRateButtonLabel(buf);
    }

    // NOTE on both pickers below: the selection applies LIVE as the roller
    // moves (VALUE_CHANGED), not only on SAVE — users closed the modal with
    // the X expecting their pick to stick, and it silently reverted.
    void openSincePeriodPicker() {
        static const char* options = "1H\n24H\n7D\n30D\nNODE ON";
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* roller = addOptionPicker(card, options, sincePeriodIndex);
        lv_obj_t* saveBtn = addModalButton(card, "SAVE", true);
        static lv_obj_t* sCard;    sCard = card;
        static UiManager* sSelf;   sSelf = this;
        lv_obj_add_event_cb(roller, [](lv_event_t* e) {
            sSelf->sincePeriodIndex = lv_roller_get_selected(lv_event_get_target(e));
            sSelf->_computeDebtDerived();
        }, LV_EVENT_VALUE_CHANGED, nullptr);
        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void openRateUnitPicker() {
        static const char* options = "SEC\nMIN\nHOUR\nDAY";
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* roller = addOptionPicker(card, options, rateUnitIndex);
        lv_obj_t* saveBtn = addModalButton(card, "SAVE", true);
        static lv_obj_t* sCard;    sCard = card;
        static UiManager* sSelf;   sSelf = this;
        lv_obj_add_event_cb(roller, [](lv_event_t* e) {
            sSelf->rateUnitIndex = lv_roller_get_selected(lv_event_get_target(e));
            sSelf->_computeDebtDerived();
        }, LV_EVENT_VALUE_CHANGED, nullptr);
        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    // Recompute the inflation-game projection ($10,000 eroded by the real annual
    // debasement rate over the selected horizon) and redraw its chart + labels.
    void _updateGameProjection() {
        static const int yearOpts[9] = {1, 3, 5, 10, 20, 30, 50, 75, 100};
        int years = yearOpts[gameYearsIndex % 9];
        double rate = _annualDebasementRate;

        lv_obj_t* c = gameScreen.getChart();
        lv_chart_series_t* s = gameScreen.getSeries();
        const int N = 24;
        lv_chart_set_point_count(c, N);

        double endV = 10000.0 * pow(1.0 / (1.0 + rate), (double)years);
        // Fit the Y axis to the curve (default 0..100 would clip $10,000 flat —
        // that's why the line/number never appeared).
        lv_coord_t lo = (lv_coord_t)(endV * 0.9);
        lv_chart_set_range(c, LV_CHART_AXIS_PRIMARY_Y, lo, 10000);
        for (int i = 0; i < N; i++) {
            double t = years * (double)i / (N - 1);
            double v = 10000.0 * pow(1.0 / (1.0 + rate), t);
            lv_chart_set_next_value(c, s, (lv_coord_t)v);
        }

        int dayCount = (int)(millis() / 86400000UL);
        gameScreen.updateProjection(dayCount, endV, years);
        gameScreen.setHorizonLabel(years);
    }

