TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
    void openGameYearsPicker() {
        static const char* options = "1Y\n3Y\n5Y\n10Y\n20Y\n30Y\n50Y\n75Y\n100Y";
        static const int yearOpts[9] = {1, 3, 5, 10, 20, 30, 50, 75, 100};
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* roller = addOptionPicker(card, options, gameYearsIndex);
        lv_obj_t* saveBtn = addModalButton(card, "SAVE", true);
        static lv_obj_t* sCard;   sCard = card;
        static UiManager* sSelf;  sSelf = this;
        // Live-apply (see note above openSincePeriodPicker).
        lv_obj_add_event_cb(roller, [](lv_event_t* e) {
            sSelf->gameYearsIndex = lv_roller_get_selected(lv_event_get_target(e));
            char lbl[10]; snprintf(lbl, sizeof(lbl), "%dY \xEF\x81\xB8", yearOpts[sSelf->gameYearsIndex % 9]);
            sSelf->gameScreen.setYearsButtonLabel(lbl);
            sSelf->_updateGameProjection();
        }, LV_EVENT_VALUE_CHANGED, nullptr);
        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    void showScreen(ScreenId id, bool animate = true,
                    lv_scr_load_anim_t anim = LV_SCR_LOAD_ANIM_MOVE_LEFT) {
        currentScreen = id;
        // Update swipe position to stay in sync with direct navigation (e.g. logo tap → home)
        for (int i = 0; i < (int)ScreenId::COUNT; i++) {
            if (_swipeOrder[i] == (uint8_t)id) { _currentSwipePos = i; break; }
        }
        // Instant (non-animated) load for the very first screen at boot: a screen
        // animation that's still running when the provisioning screen loads can
        // corrupt LVGL and crash. Navigation taps/swipes still animate.
        //
        // Same protection for fast swiping: starting a second lv_scr_load_anim
        // while the previous 300 ms one is still running is a known LVGL 8
        // crash/corruption source (two screens animating, one gets unloaded
        // mid-anim). If the user swipes again before the animation finished,
        // load the next screen instantly instead of animating.
        static uint32_t lastAnimStartAt = 0;
        if (animate && millis() - lastAnimStartAt < 350) animate = false;
        if (animate) {
            lastAnimStartAt = millis();
            lv_scr_load_anim(screens[(int)id], anim, 300, 0, false);
        } else {
            lv_scr_load(screens[(int)id]);
        }
        // Trigger data load when ticker screen becomes visible
        if (id == ScreenId::TICKERS) {
            tickerScreen.onShow(storage.getNodeCode().c_str());
        }
        // Trigger NFT load (wallet prompt or cache refresh) when NFT screen shown
        if (id == ScreenId::NFT) {
            nftScreen.onShow();
        }
        // Refresh the inflation-game projection each time it's shown (uses the
        // latest debasement rate + selected horizon).
        if (id == ScreenId::INFLATION_GAME) {
            _updateGameProjection();
        }
    }

    void attachSwipeGesture(lv_obj_t* screen) {
        lv_obj_set_user_data(screen, this);
        // A scrollable screen swallows horizontal drags as (dead-end) scrolling,
        // which made only one swipe direction register. The content fits 480×480,
        // so the screen itself never needs to scroll — clearing the flag lets both
        // left and right swipes reliably fire the gesture.
        lv_obj_clear_flag(screen, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_event_cb(screen, [](lv_event_t* e) {
            lv_obj_t* target = lv_event_get_current_target(e);
            UiManager* self = (UiManager*)lv_obj_get_user_data(target);
            if (!self) return;
            lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_get_act());
            int count = (int)ScreenId::COUNT;
            // Swipe LEFT → next screen (slides in from the right);
            // Swipe RIGHT → previous screen (slides in from the left).
            // (Touch X is mirror-corrected in the read_cb, so the gesture
            // direction is now the natural one.)
            if (dir == LV_DIR_LEFT) {
                int newPos = (self->_currentSwipePos + 1) % count;
                self->showScreen((ScreenId)self->_swipeOrder[newPos], true, LV_SCR_LOAD_ANIM_MOVE_LEFT);
            } else if (dir == LV_DIR_RIGHT) {
                int newPos = (self->_currentSwipePos - 1 + count) % count;
                self->showScreen((ScreenId)self->_swipeOrder[newPos], true, LV_SCR_LOAD_ANIM_MOVE_RIGHT);
            }
        }, LV_EVENT_GESTURE, nullptr);
    }
};
